<a href="https://colab.research.google.com/github/Oreoluwa99/demo_test/blob/main/My_Ustacky_Practices.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
###Create Pandas Dataframe

In [2]:
import pandas as pd
import numpy as np

In [3]:
stud_dict = {'Student': ('Ibrahim', 'Emeka', 'Oreoluwa'),
             'Score': (7, 8, 9)}

In [4]:
pd.DataFrame(stud_dict)

    Student  Score
0   Ibrahim      7
1     Emeka      8
2  Oreoluwa      9

In [5]:
array = np.array([[1,2,3], [4,5,6]])

In [7]:
array

array([[1, 2, 3],
       [4, 5, 6]])

In [8]:
pd.DataFrame(array, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

In [13]:
a_list = [{'a':1, 'b':2},
          {'a':4, 'b':5, 'c':6}]

In [15]:
pd.DataFrame(a_list)
#NaN stands for Not A Number

   a  b    c
0  1  2  NaN
1  4  5  6.0

In [36]:
array1 = np.arange(15).reshape(5,3)

In [37]:
array1

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [38]:
index = {'A', 'B', 'C', 'D', 'E'}
columns = {'Col1', 'Col2', 'Col3'}

In [39]:
df = pd.DataFrame(array1, index=index, columns=columns)

In [40]:
df

   Col1  Col2  Col3
E     0     1     2
A     3     4     5
D     6     7     8
C     9    10    11
B    12    13    14

In [42]:
df.index

Index(['E', 'A', 'D', 'C', 'B'], dtype='object')

In [43]:
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [44]:
df.shape

(5, 3)

In [45]:
df.dtypes

Col1    int64
Col2    int64
Col3    int64
dtype: object

In [46]:
df

   Col1  Col2  Col3
E     0     1     2
A     3     4     5
D     6     7     8
C     9    10    11
B    12    13    14

In [47]:
df.head(3)

   Col1  Col2  Col3
E     0     1     2
A     3     4     5
D     6     7     8

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, E to B
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      int64
 1   Col2    5 non-null      int64
 2   Col3    5 non-null      int64
dtypes: int64(3)
memory usage: 320.0+ bytes

In [50]:
df.reset_index()

  index  Col1  Col2  Col3
0     E     0     1     2
1     A     3     4     5
2     D     6     7     8
3     C     9    10    11
4     B    12    13    14

In [52]:
df.reset_index(inplace = True)

In [53]:
df.reset_index(inplace=True)

In [54]:
df

   level_0 index  Col1  Col2  Col3
0        0     E     0     1     2
1        1     A     3     4     5
2        2     D     6     7     8
3        3     C     9    10    11
4        4     B    12    13    14